{
  "email": "morenoricardo237@gmail.com",
  "full_name": "Ricardo Moreno",
  "avatar": "https://dtv0n64gnvy8v.cloudfront.net/39e7ed72-3b15-11eb-bac4-98460a8fcda2.jpg",
  "phone": "+57 3135472537",
  "address": "Santa Marta, Colombia",
  "profession": "Senior Full-Stack Developer",
  "description": "I am a software developer specialized in web and mobile applications with more than 6 years of experience in different Frameworks. As a professional I am in charge of the analysis, design and implementation of components, architectures and systems in the area of software development. My experience has taught me to choose wisely the resources and tools to create an applicable, scalable and efficient software solution.",
  "jobs": [
    {
      "date": "Jan 2024 - May 2024",
      "company": "Sweedies",
      "companyLink": "getsweedies.com",
      "title": "Shopify Developer (part-time)",
      "description": "Sweedies crafts indulgent, superfood-infused treats for moments of relaxation and enjoyment. Their products offers accessible indulgence, perfect for post-workout treats or movie nights. Sweedies' dedication to excellence drives me to craft captivating online experiences. As a developer, I create bespoke website themes, aligning with Sweedies' vision of quality and innovation."
    },
    {
      "date": "Jan 2024 - May 2024",
      "company": "Tonymoly Colombia",
      "companyLink": "tonymolycolombia.com",
      "title": "Shopify Developer (part-time)",
      "description": "Tonymoly Colombia, a Korean cosmetics leader since 2015, educates Latin women on Eastern-inspired skincare. Offering specialized products, I, as a developer, resolved issues and enhanced the live theme. My attention to detail maintained Tonymoly's online presence, reinforcing its position in Colombia."
    },
    {
      "date": "Jan 2023 - Dec 2023",
      "company": "ByYuto LLC",
      "companyLink": "byyuto.com",
      "title": "Full-Stack Developer",
      "description": "ByYuto LLC is a unique design, app, and web development agency that goes beyond mere service provision. They prioritize building enduring partnerships with clients, rooted in transparency, trust, and a mutual commitment to excellence. As a full-stack developer at ByYuto, I contribute to the company's mission by leveraging my expertise in both front-end and back-end development to create innovative solutions for clients. "
    },
    {
      "date": "Feb 2022 - Dec 2022",
      "company": "Insightt",
      "companyLink": "insightt.io",
      "title": "Full-Stack Javascript Developer",
      "description": "At Insightt, a top car repossession firm in the USA, I excelled as a developer. I used JavaScript (React.js) for intuitive front-end interfaces and Node.js for robust back-end functionality. Additionally, I developed mobile apps with React Native, expanding their reach and enhancing user accessibility. My expertise drove Insightt's technological advancement, ensuring ongoing success in the industry."
    },
    {
      "date": "Feb 2021 - Feb 2022",
      "company": "Tipzty",
      "companyLink": "tipzty.com",
      "title": "Full-Stack Software Developer, CTO and Shopify Developer",
      "description": "Tipzty, an e-commerce solution provider, specializes in boosting sales through live shopping and Personal Shopper assistance. As CTO for three months, I led development decisions, leveraging JavaScript (React.js), GoLang, Node.js, Flutter, and React Native. Spearheaded a Shopify app to sell services, enhancing market presence and facilitating seamless e-commerce integration. Contributed to Tipzty's mission of empowering businesses to thrive digitally through strategic innovation."
    },
    {
      "date": "Ene 2020 - Ene 2021",
      "company": "Cobuildlab",
      "companyLink": "cobuildlab.com",
      "title": "Full-Stack JavaScript Developer",
      "description": "At Cobuildlab, a cutting-edge software development company, I improved my skills in JavaScript, including React.js, Node.js, React Native, 8base, and GraphQL. I contributed to various projects, including okroo.com, jobcore.co, and menafesting.com, enriching my experience and expertise in delivering high-quality solutions."
    },
    {
      "date": "Sept 2019 - Dic 2019",
      "company": "Picap",
      "companyLink": "picap.co",
      "title": "Front-End Developer",
      "description": "At Picap, an innovative app akin to Uber in LATAM, specializing in motorcycle and car rides, I spearheaded front-end development using React.js. Notably, I undertook the responsibility of crafting a bespoke administrative panel for the company, eschewing templates to ensure tailor-made solutions."
    },
    {
      "date": "Jun 2019 - Sept 2019",
      "company": "Aerolab",
      "companyLink": "aerolab.co/expertise",
      "title": "React Native Mobile Developer",
      "description": "At Aerolab, a leading software development agency, my role as a mobile developer focused on React Native. I played a significant role in completing an app for www.personal.com.ar, showcasing my expertise in mobile development within the React Native framework."
    },
    {
      "date": "Mar 2017 - Jun 2019",
      "company": "Cmantikweb",
      "companyLink": "cmantikweb.com",
      "title": "Full-Stack Web Developer",
      "description": "My tenure at Cmantikweb marked my debut as a Full-Stack Developer in a software agency. I adeptly utilized a range of technologies including React.js, Backbone.js, PHP5+ with Laravel, MySQL, OctoberCMS, Node.js, and more. This experience laid a solid foundation for my journey as a versatile developer."
    },
    {
      "date": "Jan 2017 - Mar 2017",
      "company": "Valery",
      "companyLink": "valery.com",
      "title": "Back-End Developer",
      "description": "I specialized in developing microservices with Node.js for Valery's web and desktop applications. Valery offers a diverse range of products tailored to optimize and streamline operations across various industries, enhancing business efficiency and management."
    }
  ],
  "sections": [
    {
      "title": "Education",
      "items": [
        {
          "name": "System engineering",
          "value": "2015 - 2019 at Dr. Jose Gregorio Hernandez, Venezuela"
        }
      ]
    },
    {
      "title": "Language",
      "items": [
        {
          "name": "Spanish",
          "value": "Native"
        },
        {
          "name": "English",
          "value": "Intermediate / B2"
        }
      ]
    },
    {
      "title": "Libraries & Frameworks",
      "items": [
        {
          "name": "React.js",
          "value": "More than 6 years of experience"
        },
        {
          "name": "Node.js",
          "value": "More than 6 years of experience"
        },
        {
          "name": "React Native",
          "value": "More than 4 years of experience"
        },
        {
          "name": "Flask & Django (Python)",
          "value": "1 year of experience"
        },
        {
          "name": "GraphQL",
          "value": "1 year of experience"
        },
        {
          "name": "Wordpress, OctoberCMS & Laravel (PHP)",
          "value": "2 years of experience"
        },
        {
          "name": "Shopify",
          "value": "2 years of experience"
        }
      ]
    },
    {
      "title": "Other Skills",
      "items": [
        {
          "name": "Soft skills",
          "value": "Teamwork, Problem solving, Creativity, Patience and Communication"
        },
        {
          "name": "Adobe Programs",
          "value": "Adobe XD, Adobe Illustrator and Photoshop"
        },
        {
          "name": "Operating systems",
          "value": "Windows, macOS and Linux"
        }
      ]
    }
  ]
}
