{
  "email": "morenoricardo237@gmail.com",
  "full_name": "Ricardo Moreno",
  "avatar": "/me.png",
  "phone": "+58 4146045837",
  "address": "Maracaibo, Venezuela",
  "profession": "Desarrollador Full-Stack Senior",
  "social_links": [
    {
      "name": "GitHub",
      "url": "https://github.com/rich-97",
      "icon": "github"
    },
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/ricardo-moreno-dev",
      "icon": "linkedin"
    }
  ],
  "skills": [
    "React.js",
    "Node.js",
    "React Native",
    "TypeScript",
    "GraphQL",
    "Redux",
    "Jest",
    "Shopify"
  ],
  "description": "Ingeniero Full-Stack Senior con más de 6 años de experiencia desarrollando aplicaciones web y móviles escalables, especializado en React.js, Node.js, TypeScript y React Native. Trayectoria comprobada liderando equipos de desarrollo, mentoreando desarrolladores y arquitectando marketplaces de alto rendimiento, plataformas B2C y soluciones de comercio electrónico. Experto en optimización de aplicaciones móviles, integración de módulos nativos e implementación de pipelines robustos de CI/CD.",
  "jobs": [
    {
      "date": "Marzo 2025 - Presente",
      "company": "Yummy Rides",
      "companyLink": "yummysuperapp.com",
      "title": "Desarrollador Full-Stack Senior",
      "description": "Desarrollador full-stack después de que Yummy Rides adquiriera ForTodos LLC. Enfocado en escalar el marketplace, mejorar el rendimiento y la confiabilidad. Trabajé en Yummy Marketplace, Yummy Rides y Yummy Payments utilizando TypeScript, React Native y Node.js.",
      "achievements": [
        "Lideré la integración de Yummy Marketplace en la aplicación Android de Yummy Rides, conectando Android nativo (Kotlin/Java) con React Native usando TypeScript para ofrecer una experiencia de usuario fluida y garantizar builds estables listos para producción.",
        "Arquitecté y modernizé la infraestructura multimedia y de la aplicación usando TypeScript y React Native, resolviendo cuellos de botella de rendimiento, mejorando los flujos de navegación con React Navigation y aumentando la confiabilidad general en dispositivos iOS y Android.",
        "Diseñé e implementé flujos seguros de pagos y desembolsos de extremo a extremo en móvil (React Native) y backend (Node.js/TypeScript), incluyendo verificación, reembolsos y gestión de desembolsos, fortaleciendo la confianza y escalabilidad.",
        "Mejoré la seguridad de la plataforma y la experiencia del usuario estandarizando APIs RESTful con TypeScript, agregando validaciones robustas, implementando manejo integral de errores e integrando monitoreo en tiempo real con herramientas de reporte de crashes.",
        "Implementé testing automatizado con Jest y React Native Testing Library, asegurando la calidad del código y reduciendo bugs de regresión en un 40%."
      ]
    },
    {
      "date": "Junio 2024 - Marzo 2025",
      "company": "ForTodos LLC",
      "companyLink": "fortodos.com",
      "title": "Desarrollador Full-Stack Senior",
      "description": "ForTodos es una aplicación móvil diseñada para facilitar la compra y venta de artículos usados de manera segura y confiable. Funciona como un marketplace digital similar a \"Los Corotos\", permitiendo a los usuarios vender productos que ya no usan y adquirir artículos de segunda mano en su área local. Trabajé como desarrollador full-stack senior en ForTodos, donde fui responsable de arquitectar nuevas funcionalidades, optimizar el rendimiento y mejorar el producto actual.",
      "achievements": [
        "Optimicé los tiempos de respuesta de la API en un 60% mediante optimización de consultas, estrategias de caché con Redis e implementación de gestión de estado eficiente con Redux, mejorando significativamente el rendimiento general de la aplicación.",
        "Lideré esfuerzos de optimización de rendimiento móvil para dispositivos con poca RAM, implementando mejores prácticas de gestión de memoria, carga diferida y división de código en React Native, mejorando la estabilidad de la app en dispositivos Android de gama baja en un 45%.",
        "Arquitecté e implementé funcionalidades en tiempo real incluyendo chat y notificaciones push usando WebSockets y Firebase Cloud Messaging, asegurando entrega de mensajes en menos de un segundo y experiencia de usuario fluida.",
        "Adquirida exitosamente por Yummy Rides en enero de 2025, con la transición del producto completada antes de lo programado."
      ]
    },
    {
      "date": "Ene 2024 - May 2024",
      "company": "Sweedies",
      "companyLink": "getsweedies.com",
      "title": "Desarrollador Shopify Senior (medio tiempo)",
      "description": "Sweedies crea golosinas indulgentes infusionadas con superalimentos para momentos de relajación y disfrute. Sus productos ofrecen indulgencia accesible, perfecta para después del entrenamiento o noches de películas. La dedicación de Sweedies a la excelencia me impulsa a crear experiencias en línea cautivadoras. Como desarrollador, creo temas de sitios web personalizados, alineándome con la visión de Sweedies de calidad e innovación.",
      "achievements": [
        "Construí un tema de Shopify completamente nuevo desde cero con un diseño único optimizado para conversión en tiempo récord, mejorando la velocidad de carga de la página en un 50% y aumentando las conversiones móviles en un 25%."
      ]
    },
    {
      "date": "Ene 2024 - May 2024",
      "company": "Tonymoly Colombia",
      "companyLink": "tonymolycolombia.com",
      "title": "Desarrollador Shopify Senior (medio tiempo)",
      "description": "Tonymoly Colombia, líder en cosméticos coreanos desde 2015, educa a las mujeres latinoamericanas sobre el cuidado de la piel inspirado en Oriente. Ofreciendo productos especializados, yo, como desarrollador, resolví problemas y mejoré el tema en vivo. Mi atención al detalle mantuvo la presencia en línea de Tonymoly, reforzando su posición en Colombia.",
      "achievements": [
        "Rediseñé y mejoré la interfaz de usuario usando estándares web modernos y mejores prácticas de accesibilidad, resultando en una experiencia de usuario significativamente mejor y un aumento del 30% en el engagement de usuarios.",
        "Optimicé el sitio web usando Lighthouse de Chrome, implementando mejores prácticas de rendimiento, carga diferida de imágenes y minificación de código, mejorando los puntajes de Core Web Vitals de 45 a 92 y reduciendo la tasa de rebote en un 20%."
      ]
    },
    {
      "date": "Ene 2023 - Dic 2023",
      "company": "ByYuto LLC",
      "companyLink": "byyuto.com",
      "title": "Desarrollador Full-Stack Senior",
      "description": "ByYuto LLC es una agencia única de diseño, aplicaciones y desarrollo web que va más allá de la simple provisión de servicios. Priorizan construir asociaciones duraderas con los clientes, arraigadas en transparencia, confianza y un compromiso mutuo con la excelencia. Como desarrollador full-stack senior en ByYuto, contribuí a la misión de la empresa aprovechando mi experiencia en TypeScript, React.js, Node.js y React Native para arquitectar soluciones innovadoras para los clientes.",
      "achievements": [
        "Lideré la migración completa de una API legacy en JavaScript a TypeScript, implementando tipado estricto, mejorando la mantenibilidad del código en un 70% y reduciendo errores en tiempo de ejecución en un 85%.",
        "Arquitecté y desarrollé funcionalidades potenciadas por IA para la plataforma de servicio al cliente de un cliente, implementando un bot de respuesta automática usando procesamiento de lenguaje natural, lo que redujo los tiempos de respuesta en un 65% y mejoró los puntajes de satisfacción del cliente.",
        "Establecí una cultura de testing implementando Jest y React Testing Library, logrando un 80% de cobertura de código en la lógica de negocio crítica.",
        "Colaboré con equipos multifuncionales para entregar proyectos complejos para clientes, asegurando la calidad del código mediante testing integral y prácticas de desarrollo modernas."
      ]
    },
    {
      "date": "Feb 2022 - Dic 2022",
      "company": "Insightt",
      "companyLink": "insightt.io",
      "title": "Desarrollador Full-Stack Javascript Senior",
      "description": "En Insightt, una empresa líder en recuperación de automóviles en EE.UU., sobresalí como desarrollador senior. Utilicé TypeScript y React.js para interfaces front-end intuitivas y Node.js para funcionalidad back-end robusta. Además, desarrollé y optimicé aplicaciones móviles con React Native, expandiendo su alcance y mejorando la accesibilidad del usuario. Mi experiencia impulsó el avance tecnológico de Insightt, asegurando el éxito continuo en la industria.",
      "achievements": [
        "Mejoré significativamente la funcionalidad de geolocalización en la app de React Native a través de refactorización de código, implementación de algoritmos eficientes de procesamiento de datos e integración de módulos nativos para optimización de GPS, reduciendo el consumo de batería en un 40% y mejorando la precisión de ubicación en un 60%.",
        "Implementé suite completa de testing usando Jest y Detox para testing end-to-end móvil, reduciendo bugs en producción en un 50%.",
        "Optimicé los pipelines de build móvil usando Xcode y Android Studio, reduciendo los tiempos de compilación en un 35% y agilizando el proceso de despliegue a TestFlight y Google Play Console."
      ]
    },
    {
      "date": "Feb 2021 - Feb 2022",
      "company": "Tipzty",
      "companyLink": "tipzty.com",
      "title": "CTO, Desarrollador Full-Stack y Tech Lead",
      "description": "Tipzty, proveedor de soluciones de comercio electrónico, se especializa en aumentar las ventas a través de live shopping y asistencia de Personal Shopper. Como CTO durante tres meses y tech lead, lideré todas las decisiones de desarrollo y gestión de equipo, aprovechando TypeScript, React.js, GoLang, Node.js, Flutter y React Native. Encabecé decisiones de arquitectura para una aplicación de Shopify para vender servicios, mejorando la presencia en el mercado y facilitando una integración de comercio electrónico sin problemas. Contribuí a la misión de Tipzty de empoderar a las empresas a prosperar digitalmente a través de la innovación estratégica.",
      "achievements": [
        "Como CTO, lideré un equipo multifuncional de 5 desarrolladores y 2 diseñadores, estableciendo metodologías ágiles (Scrum), planificación de sprints y procesos de revisión de código que mejoraron la velocidad de entrega en un 40% y la entrega a tiempo al 95%.",
        "Arquitecté y desarrollé una plataforma de comercio electrónico con transmisiones en vivo en tiempo real usando React.js y WebRTC, permitiendo a los comerciantes vender productos durante transmisiones en vivo, resultando en tasas de conversión 3x más altas comparadas con el comercio electrónico tradicional.",
        "Desarrollé un plugin integral de Shopify usando React.js y Node.js que integró reseñas en video y funcionalidad de transmisión en vivo, mejorando las métricas de engagement del cliente en un 150% y aumentando el valor promedio de pedido en un 35%.",
        "Construí una aplicación móvil multiplataforma con React Native con características avanzadas de cámara y capacidades de transmisión en tiempo real, publicada en la App Store de iOS y Google Play Store, alcanzando más de 50K descargas en los primeros 3 meses.",
        "Mentoreé a los miembros del equipo en mejores prácticas de React Native, TypeScript, gestión de estado con Redux y procesos de despliegue de apps móviles, conduciendo revisiones de código semanales y sesiones de capacitación técnica.",
        "Implementé pipelines de CI/CD usando GitHub Actions para testing y despliegue automatizados, reduciendo el tiempo de despliegue de horas a minutos y minimizando el error humano."
      ]
    },
    {
      "date": "Ene 2020 - Ene 2021",
      "company": "Cobuildlab",
      "companyLink": "cobuildlab.com",
      "title": "Desarrollador Full-Stack JavaScript",
      "description": "En Cobuildlab, una empresa de desarrollo de software de vanguardia, mejoré mis habilidades en JavaScript, TypeScript, React.js, Node.js, React Native, 8base y GraphQL. Contribuí a varios proyectos, incluyendo okroo.com, jobcore.co y menafesting.com, enriqueciendo mi experiencia y pericia en la entrega de soluciones de alta calidad con frameworks y herramientas modernas.",
      "achievements": [
        "Arquitecté y desarrollé una aplicación móvil completa desde cero usando React Native y GraphQL, donde estuve involucrado tanto en el desarrollo como en el diseño UI/UX, implementando diseños pixel-perfect con animaciones personalizadas usando React Native Reanimated y asegurando una excelente experiencia de usuario.",
        "Implementé integraciones de API GraphQL con Apollo Client, optimizando patrones de obtención de datos y reduciendo las solicitudes de red en un 60%.",
        "Colaboré con equipos multifuncionales en un ambiente ágil, participando en standups diarios, planificación de sprints y retrospectivas."
      ]
    },
    {
      "date": "Sept 2019 - Dic 2019",
      "company": "Picap",
      "companyLink": "picap.co",
      "title": "Desarrollador Front-End y Mentor Técnico",
      "description": "En Picap, una app innovadora similar a Uber en LATAM, especializada en viajes en motocicleta y automóvil, lideré el desarrollo front-end usando React.js. Notablemente, asumí la responsabilidad de crear un panel administrativo personalizado para la empresa desde cero, evitando plantillas para garantizar soluciones escalables hechas a medida.",
      "achievements": [
        "Lideré iniciativas de mentoría técnica, enseñando a los colegas flujos de trabajo de Git (estrategias de branching, pull requests, revisiones de código), mejores prácticas de React.js y patrones modernos de JavaScript (ES6+), mejorando la colaboración del equipo y reduciendo conflictos de merge en un 70%.",
        "Establecí cultura de revisión de código y estándares de documentación, creando wiki interna con biblioteca de componentes de React y guías de estilo.",
        "Arquitecté y desarrollé un panel administrativo personalizado usando React.js y Redux para gestión de estado, implementando control de acceso basado en roles y visualización de datos en tiempo real."
      ]
    },
    {
      "date": "Jun 2019 - Sept 2019",
      "company": "Aerolab",
      "companyLink": "aerolab.co/expertise",
      "title": "Desarrollador Móvil React Native",
      "description": "En Aerolab, una agencia líder en desarrollo de software, mi rol como desarrollador móvil se centró en el desarrollo de React Native para aplicaciones fintech de alto riesgo. Jugué un papel significativo en completar una app bancaria para www.personal.com.ar, mostrando mi experiencia en desarrollo móvil, mejores prácticas de seguridad y el framework React Native.",
      "achievements": [
        "Resolví más de 50 bugs críticos en una app bancaria en producción, implementando prácticas de codificación segura, encriptación para datos sensibles y soluciones de almacenamiento seguro (Keychain/Keystore), lo que me permitió obtener conocimientos valiosos en el campo fintech y temas de seguridad móvil.",
        "Implementé autenticación biométrica (Face ID/Touch ID) y flujos de autenticación multifactor, asegurando el cumplimiento de estándares de seguridad bancaria.",
        "Trabajé extensivamente con módulos nativos en Swift y Java para integrar SDKs bancarios y sistemas de procesamiento de pagos."
      ]
    },
    {
      "date": "Mar 2017 - Jun 2019",
      "company": "Cmantikweb",
      "companyLink": "cmantikweb.com",
      "title": "Desarrollador Web Full-Stack",
      "description": "Mi permanencia en Cmantikweb marcó mi debut como Desarrollador Full-Stack en una agencia de software. Utilicé hábilmente una variedad de tecnologías incluyendo React.js, Backbone.js, PHP5+ con Laravel, MySQL, OctoberCMS, Node.js y más. Esta experiencia sentó una base sólida para mi trayectoria como desarrollador versátil.",
      "achievements": [
        "Lideré exitosamente la migración de un sitio web de alto tráfico de WordPress a OctoberCMS, implementando optimizaciones de rendimiento, mejoras en consultas de base de datos y estrategias de caché que mejoraron los tiempos de carga de página en un 65% y rankings SEO.",
        "Obtuve conocimientos significativos al crear animaciones complejas con JavaScript y usar la API de Canvas para construir componentes interactivos, incluyendo visualizaciones de datos y elementos de UI personalizados.",
        "Desarrollé APIs RESTful usando Laravel y Node.js, implementando autenticación, autorización y limitación de tasa."
      ]
    },
    {
      "date": "Ene 2017 - Mar 2017",
      "company": "Valery",
      "companyLink": "valery.com",
      "title": "Desarrollador Back-End",
      "description": "Me especialicé en desarrollar microservicios con Node.js para las aplicaciones web y de escritorio de Valery. Valery ofrece una gama diversa de productos diseñados para optimizar y agilizar operaciones en varias industrias, mejorando la eficiencia empresarial y la gestión.",
      "achievements": [
        "Participé en la migración de los servicios legacy de la empresa desde Delphi a arquitectura de microservicios con Node.js, implementando APIs RESTful, mejorando la escalabilidad en un 200%, reduciendo costos de servidor en un 40% y habilitando capacidades de escalamiento horizontal."
      ]
    }
  ],
  "sections": [
    {
      "title": "Idioma",
      "items": [
        {
          "name": "Español",
          "value": "Nativo"
        },
        {
          "name": "Inglés",
          "value": "Competencia Profesional de Trabajo / B2+"
        }
      ]
    },
    {
      "title": "Educación",
      "items": [
        {
          "name": "Ingeniería de Sistemas",
          "value": "2015 - 2019 en Dr. Jose Gregorio Hernandez, Venezuela"
        }
      ]
    },
    {
      "title": "Habilidades Técnicas",
      "items": [
        {
          "name": "Desarrollo Móvil",
          "value": "React Native (4+ años), Expo (managed and bare workflows), React Navigation, React Native Reanimated, Gesture Handler, módulos nativos con React Native (Swift, Objective-C, Kotlin, Java)"
        },
        {
          "name": "Frontend",
          "value": "React.js (6+ años), Next.js, Vite, TypeScript (3+ años), JavaScript (ES6+), Redux, Recoil, Context API, HTML5, CSS3, Tailwind CSS"
        },
        {
          "name": "Backend",
          "value": "Node.js (6+ años), Nest.js, Express.js, GraphQL, APIs RESTful, WebSockets, Microservicios"
        },
        {
          "name": "Testing y Calidad",
          "value": "Jest, Vitest, Detox, React Native Testing Library, React Testing Library, Unit Testing, Integration Testing, E2E Testing"
        },
        {
          "name": "DevOps y Herramientas",
          "value": "Git, GitHub, GitLab, CI/CD (GitHub Actions, Fastlane), Xcode, Android Studio, Docker, Firebase, Sentry, Analytics"
        },
        {
          "name": "Herramientas de IA",
          "value": "Cursor, GitHub Copilot, Claude Code, Gemini, ChatGPT, Codex"
        },
        {
          "name": "Bases de Datos",
          "value": "PostgreSQL, MySQL, MongoDB, Redis, Firebase Realtime Database"
        },
        {
          "name": "Otros Frameworks",
          "value": "Flask y Django (Python), Laravel (PHP), Shopify (Liquid, Desarrollo de Temas)"
        }
      ]
    },
    {
      "title": "Liderazgo y Habilidades Blandas",
      "items": [
        {
          "name": "Liderazgo",
          "value": "Liderazgo de Equipos, Mentoría Técnica, Revisiones de Código, Agile/Scrum, Planificación de Sprints, Diseño de Arquitectura"
        },
        {
          "name": "Competencias Principales",
          "value": "Resolución de Problemas, Colaboración Multifuncional, Comunicación, Atención al Detalle, Optimización de Rendimiento"
        }
      ]
    },
    {
      "title": "Herramientas de Diseño",
      "items": [
        {
          "name": "Diseño y Prototipado",
          "value": "Figma, Adobe XD, Adobe Illustrator, Photoshop"
        }
      ]
    },
    {
      "title": "Sistemas Operativos",
      "items": [
        {
          "name": "Plataformas",
          "value": "macOS, Windows, Linux (Ubuntu, Debian)"
        }
      ]
    }
  ]
}