{
  "email": "morenoricardo237@gmail.com",
  "full_name": "Ricardo Moreno",
  "avatar": "/me.png",
  "phone": "+58 4146045837",
  "address": "Maracaibo, Venezuela",
  "profession": "Senior Full-Stack Developer",
  "social_links": [
    {
      "name": "GitHub",
      "url": "https://github.com/rich-97",
      "icon": "github"
    },
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/ricardo-moreno-dev",
      "icon": "linkedin"
    }
  ],
  "skills": [
    "React.js",
    "Node.js", 
    "React Native",
    "TypeScript",
    "GraphQL",
    "Redux",
    "Jest",
    "Shopify"
  ],
  "description": "Senior Full-Stack Engineer with 6+ years of experience building scalable web and mobile applications, specialized in React.js, Node.js, TypeScript, and React Native. Proven track record leading development teams, mentoring developers, and architecting high-performance marketplaces, B2C platforms, and e‑commerce solutions. Expert in mobile app optimization, native module integration, and implementing robust CI/CD pipelines.",
  "jobs": [
    {
      "date": "March 2025 - Present",
      "company": "Yummy Rides",
      "companyLink": "yummysuperapp.com",
      "title": "Senior Full-Stack Developer",
      "description": "Full-stack developer after Yummy Rides acquired ForTodos LLC. Focused on scaling the marketplace, performance, and reliability. Worked on the Yummy Marketplace, Yummy Rides, and Yummy Payments using TypeScript, React Native, and Node.js.",
      "achievements": [
        "Led the integration of Yummy Marketplace into the Yummy Rides Android app, bridging native Android (Kotlin/Java) and React Native with TypeScript to deliver a seamless user experience and ensure stable, production-ready builds.",
        "Architected and modernized the multimedia and app infrastructure using TypeScript and React Native, resolving performance bottlenecks, improving navigation flows with React Navigation, and enhancing overall reliability across iOS and Android devices.",
        "Designed and implemented secure end-to-end payment and payout flows on both mobile (React Native) and backend (Node.js/TypeScript), including verification, refunds, and disbursement management, strengthening trust and scalability.",
        "Improved platform security and user experience by standardizing RESTful APIs with TypeScript, adding robust validations, implementing comprehensive error handling, and integrating real-time monitoring with crash reporting tools.",
        "Implemented automated testing with Jest and React Native Testing Library, ensuring code quality and reducing regression bugs by 40%."
      ]
    },
    {
      "date": "June 2024 - March 2025",
      "company": "ForTodos LLC",
      "companyLink": "fortodos.com",
      "title": "Senior Full-Stack Developer",
      "description": "ForTodos is a mobile application designed to facilitate the buying and selling of used items in a safe and reliable way. It works as a digital marketplace similar to \"Los Corotos,\" allowing users to sell products they no longer use and acquire second-hand items in their local area. I worked as a senior full-stack developer at ForTodos, where I was responsible for architecting new features, optimizing performance, and improving the current product.",
      "achievements": [
        "Optimized API response times by 60% through query optimization, caching strategies with Redis, and implementing efficient state management with Redux, significantly enhancing the overall application performance.",
        "Led mobile performance optimization efforts for devices with low RAM, implementing memory management best practices, lazy loading, and code splitting in React Native, improving app stability on budget Android devices by 45%.",
        "Architected and implemented real-time features including chat and push notifications using WebSockets and Firebase Cloud Messaging, ensuring sub-second message delivery and seamless user experience.",
        "Successfully acquired by Yummy Rides in Jan 2025, with product transition completed ahead of schedule."
      ]
    },
    {
      "date": "Jan 2024 - May 2024",
      "company": "Sweedies",
      "companyLink": "getsweedies.com",
      "title": "Senior Shopify Developer (part-time)",
      "description": "Sweedies crafts indulgent, superfood-infused treats for moments of relaxation and enjoyment. Their products offers accessible indulgence, perfect for post-workout treats or movie nights. Sweedies' dedication to excellence drives me to craft captivating online experiences. As a developer, I create bespoke website themes, aligning with Sweedies' vision of quality and innovation.",
      "achievements": [
        "Built an entirely new Shopify theme from scratch with a unique, conversion-optimized design in record time, improving page load speed by 50% and increasing mobile conversions by 25%."
      ]
    },
    {
      "date": "Jan 2024 - May 2024",
      "company": "Tonymoly Colombia",
      "companyLink": "tonymolycolombia.com",
      "title": "Senior Shopify Developer (part-time)",
      "description": "Tonymoly Colombia, a Korean cosmetics leader since 2015, educates Latin women on Eastern-inspired skincare. Offering specialized products, I, as a developer, resolved issues and enhanced the live theme. My attention to detail maintained Tonymoly's online presence, reinforcing its position in Colombia.",
      "achievements": [
        "Redesigned and improved the UI using modern web standards and accessibility best practices, resulting in a significantly better user experience and 30% increase in user engagement.",
        "Optimized the website using Lighthouse from Chrome, implementing performance best practices, lazy loading images, and code minification, improving Core Web Vitals scores from 45 to 92 and reducing bounce rate by 20%."
      ]
    },
    {
      "date": "Jan 2023 - Dec 2023",
      "company": "ByYuto LLC",
      "companyLink": "byyuto.com",
      "title": "Senior Full-Stack Developer",
      "description": "ByYuto LLC is a unique design, app, and web development agency that goes beyond mere service provision. They prioritize building enduring partnerships with clients, rooted in transparency, trust, and a mutual commitment to excellence. As a senior full-stack developer at ByYuto, I contributed to the company's mission by leveraging my expertise in TypeScript, React.js, Node.js, and React Native to architect innovative solutions for clients.",
      "achievements": [
        "Led the complete migration of a legacy JavaScript API to TypeScript, implementing strict type safety, improving code maintainability by 70%, and reducing runtime errors by 85%.",
        "Architected and developed AI-powered features for a client's customer service platform, implementing an automatic response bot using natural language processing, which reduced response times by 65% and improved customer satisfaction scores.",
        "Established testing culture by implementing Jest and React Testing Library, achieving 80% code coverage across critical business logic.",
        "Collaborated with cross-functional teams to deliver complex client projects, ensuring code quality through comprehensive testing and modern development practices."
      ]
    },
    {
      "date": "Feb 2022 - Dec 2022",
      "company": "Insightt",
      "companyLink": "insightt.io",
      "title": "Senior Full-Stack Javascript Developer",
      "description": "At Insightt, a top car repossession firm in the USA, I excelled as a senior developer. I used TypeScript and React.js for intuitive front-end interfaces and Node.js for robust back-end functionality. Additionally, I developed and optimized mobile apps with React Native, expanding their reach and enhancing user accessibility. My expertise drove Insightt's technological advancement, ensuring ongoing success in the industry.",
      "achievements": [
        "Significantly improved the geolocation functionality in the React Native app through code refactoring, implementing efficient data processing algorithms, and integrating native modules for GPS optimization, reducing battery consumption by 40% and improving location accuracy by 60%.",
        "Implemented comprehensive testing suite using Jest and Detox for end-to-end mobile testing, reducing production bugs by 50%.",
        "Optimized mobile build pipelines using Xcode and Android Studio, reducing build times by 35% and streamlining the deployment process to TestFlight and Google Play Console."
      ]
    },
    {
      "date": "Feb 2021 - Feb 2022",
      "company": "Tipzty",
      "companyLink": "tipzty.com",
      "title": "CTO, Full-Stack Software Developer & Tech Lead",
      "description": "Tipzty, an e-commerce solution provider, specializes in boosting sales through live shopping and Personal Shopper assistance. As CTO for three months and tech lead, I led all development decisions and team management, leveraging TypeScript, React.js, GoLang, Node.js, Flutter, and React Native. Spearheaded architecture decisions for a Shopify app to sell services, enhancing market presence and facilitating seamless e-commerce integration. Contributed to Tipzty's mission of empowering businesses to thrive digitally through strategic innovation.",
      "achievements": [
        "As CTO, led a cross-functional team of 5 developers and 2 designers, establishing agile methodologies (Scrum), sprint planning, and code review processes that improved delivery velocity by 40% and on-time delivery to 95%.",
        "Architected and developed a real-time live streaming e-commerce platform using React.js and WebRTC, enabling merchants to sell products during live streams, resulting in 3x conversion rates compared to traditional e-commerce.",
        "Developed a comprehensive Shopify plugin using React.js and Node.js that integrated video reviews and live stream functionality, improving customer engagement metrics by 150% and increasing average order value by 35%.",
        "Built a cross-platform React Native mobile app with advanced camera features and real-time streaming capabilities, published to both iOS App Store and Google Play Store, achieving 50K+ downloads in first 3 months.",
        "Mentored team members on best practices for React Native, TypeScript, state management with Redux, and mobile app deployment processes, conducting weekly code reviews and technical training sessions.",
        "Implemented CI/CD pipelines using GitHub Actions for automated testing and deployment, reducing deployment time from hours to minutes and minimizing human error."
      ]
    },
    {
      "date": "Ene 2020 - Ene 2021",
      "company": "Cobuildlab",
      "companyLink": "cobuildlab.com",
      "title": "Full-Stack JavaScript Developer",
      "description": "At Cobuildlab, a cutting-edge software development company, I improved my skills in JavaScript, TypeScript, React.js, Node.js, React Native, 8base, and GraphQL. I contributed to various projects, including okroo.com, jobcore.co, and menafesting.com, enriching my experience and expertise in delivering high-quality solutions with modern frameworks and tools.",
      "achievements": [
        "Architected and developed a complete mobile application from scratch using React Native and GraphQL, where I was involved in both development and UI/UX design, implementing pixel-perfect designs with custom animations using React Native Reanimated and ensuring an excellent user experience.",
        "Implemented GraphQL API integrations with Apollo Client, optimizing data fetching patterns and reducing network requests by 60%.",
        "Collaborated with cross-functional teams in an agile environment, participating in daily standups, sprint planning, and retrospectives."
      ]
    },
    {
      "date": "Sept 2019 - Dic 2019",
      "company": "Picap",
      "companyLink": "picap.co",
      "title": "Front-End Developer & Technical Mentor",
      "description": "At Picap, an innovative app akin to Uber in LATAM, specializing in motorcycle and car rides, I spearheaded front-end development using React.js. Notably, I undertook the responsibility of crafting a bespoke administrative panel for the company from scratch, eschewing templates to ensure tailor-made, scalable solutions.",
      "achievements": [
        "Led technical mentoring initiatives, teaching colleagues Git workflows (branching strategies, pull requests, code reviews), React.js best practices, and modern JavaScript (ES6+) patterns, improving team collaboration and reducing merge conflicts by 70%.",
        "Established code review culture and documentation standards, creating internal wiki with React component library and style guides.",
        "Architected and developed a custom administrative panel using React.js and Redux for state management, implementing role-based access control and real-time data visualization."
      ]
    },
    {
      "date": "Jun 2019 - Sept 2019",
      "company": "Aerolab",
      "companyLink": "aerolab.co/expertise",
      "title": "React Native Mobile Developer",
      "description": "At Aerolab, a leading software development agency, my role as a mobile developer focused on React Native development for high-stakes fintech applications. I played a significant role in completing a banking app for www.personal.com.ar, showcasing my expertise in mobile development, security best practices, and the React Native framework.",
      "achievements": [
        "Resolved 50+ critical bugs in a production banking app, implementing secure coding practices, encryption for sensitive data, and secure storage solutions (Keychain/Keystore), which allowed me to gain valuable knowledge in the fintech field and mobile security topics.",
        "Implemented biometric authentication (Face ID/Touch ID) and multi-factor authentication flows, ensuring compliance with banking security standards.",
        "Worked extensively with native modules in Swift and Java to integrate banking SDKs and payment processing systems."
      ]
    },
    {
      "date": "Mar 2017 - Jun 2019",
      "company": "Cmantikweb",
      "companyLink": "cmantikweb.com",
      "title": "Full-Stack Web Developer",
      "description": "My tenure at Cmantikweb marked my debut as a Full-Stack Developer in a software agency. I adeptly utilized a range of technologies including React.js, Backbone.js, PHP5+ with Laravel, MySQL, OctoberCMS, Node.js, and more. This experience laid a solid foundation for my journey as a versatile developer.",
      "achievements": [
        "Successfully led the migration of a high-traffic website from WordPress to OctoberCMS, implementing performance optimizations, database query improvements, and caching strategies that improved page load times by 65% and SEO rankings.",
        "Gained significant knowledge by creating complex animations with JavaScript and using the Canvas API to build interactive components, including data visualizations and custom UI elements.",
        "Developed RESTful APIs using Laravel and Node.js, implementing authentication, authorization, and rate limiting."
      ]
    },
    {
      "date": "Jan 2017 - Mar 2017",
      "company": "Valery",
      "companyLink": "valery.com",
      "title": "Back-End Developer",
      "description": "I specialized in developing microservices with Node.js for Valery's web and desktop applications. Valery offers a diverse range of products tailored to optimize and streamline operations across various industries, enhancing business efficiency and management.",
      "achievements": [
        "Participated in migrating the company's legacy services from Delphi to Node.js microservices architecture, implementing RESTful APIs, improving scalability by 200%, reducing server costs by 40%, and enabling horizontal scaling capabilities."
      ]
    }
  ],
  "sections": [
    {
      "title": "Language",
      "items": [
        {
          "name": "Spanish",
          "value": "Native"
        },
        {
          "name": "English",
          "value": "Professional Working Proficiency / B2+"
        }
      ]
    },
    {
      "title": "Education",
      "items": [
        {
          "name": "System Engineering",
          "value": "2015 - 2019 at Dr. Jose Gregorio Hernandez, Venezuela"
        }
      ]
    },
    {
      "title": "Technical Skills",
      "items": [
        {
          "name": "Mobile Development",
          "value": "React Native (4+ years), Expo, React Navigation, React Native Reanimated, Gesture Handler, native modules (Swift, Objective-C, Kotlin, Java)"
        },
        {
          "name": "Frontend",
          "value": "React.js (6+ years), TypeScript (3+ years), JavaScript (ES6+), Redux, Recoil, Context API, HTML5, CSS3, Tailwind CSS"
        },
        {
          "name": "Backend",
          "value": "Node.js (6+ years), Express.js, GraphQL, RESTful APIs, WebSockets, Microservices"
        },
        {
          "name": "Testing & Quality",
          "value": "Jest, Detox, React Native Testing Library, React Testing Library, Unit Testing, Integration Testing, E2E Testing"
        },
        {
          "name": "DevOps & Tools",
          "value": "Git, GitHub, GitLab, CI/CD (GitHub Actions, Fastlane), Xcode, Android Studio, Docker, Firebase, Sentry, Analytics"
        },
        {
          "name": "Databases",
          "value": "PostgreSQL, MySQL, MongoDB, Redis, Firebase Realtime Database"
        },
        {
          "name": "Other Frameworks",
          "value": "Flask & Django (Python), Laravel (PHP), Shopify (Liquid, Theme Development)"
        }
      ]
    },
    {
      "title": "Leadership & Soft Skills",
      "items": [
        {
          "name": "Leadership",
          "value": "Team Leadership, Technical Mentoring, Code Reviews, Agile/Scrum, Sprint Planning, Architecture Design"
        },
        {
          "name": "Core Competencies",
          "value": "Problem Solving, Cross-functional Collaboration, Communication, Attention to Detail, Performance Optimization"
        }
      ]
    },
    {
      "title": "Design Tools",
      "items": [
        {
          "name": "Design & Prototyping",
          "value": "Figma, Adobe XD, Adobe Illustrator, Photoshop"
        }
      ]
    },
    {
      "title": "Operating Systems",
      "items": [
        {
          "name": "Platforms",
          "value": "macOS, Windows, Linux (Ubuntu, Debian)"
        }
      ]
    }
  ]
}